Repository: GNUSim8085/GNUSim8085
Catalog: po/*.po
Languages: eo

source: Select font
eo: Elektu tiparon

source: Program has errors. Check the Message pane.
eo: Programo havas erarojn. Montru mesaĝan panelon.

source: Error executing program
eo: Eraro dum rulado de programo

source: Error in step in
eo: Eraro en enpaŝo

source: Error in step over
eo: Eraro en transpaŝo

source: Error in step out
eo: Eraro en elpaŝo

source: Enter a valid number within range
eo: Tajpu validan nombron en intervalo

source: Enter a valid number within range (0-65535 or 0h-FFFFh)
eo: Tajpu validan nombron en intervalo (0-65535 aŭ 0h-FFFFh)

source: Enter a valid number within range (0-255 / 0h-00FFh)
eo: Tajpu validan nombron en intervalo (0-255 aŭ 0h-00FFh)

source: The tutorial file, asm-guide.txt, was not found. It should be present in directory -
eo: La lernila dosiero, asm-guide.txt, ne troviĝis. Ĝi devas esti en dosierujo -

source: _File
eo: _Dosiero

source: _Reset
eo: _Restarigi

source: _Assembler
eo: _Asemblilo

source: _Debug
eo: _Sencimigi

source: _Breakpoints
eo: _Paŭzpunktoj

source: _Help
eo: _Helpo

source: New source file
eo: Nova fontodosiero

source: Open a file
eo: Malfermi dosieron

source: Save file
eo: Konservi dosieron

source: Save file as
eo: Konservi dosieron kiel

source: Print program
eo: Presi programon

source: _Registers
eo: _Dateningoj

source: Reset Registers
eo: Restarigi Dateningojn

source: _Flags
eo: _Flagoj

source: Reset Flags
eo: Restarigi Flagojn

source: _IO Ports
eo: Enel_igaj Pordoj

source: Reset IO Ports
eo: Restarigi Eneligajn Pordojn

source: _Memory
eo: _Memoro

source: Reset Memory
eo: Restarigi Memoron

source: Reset _All
eo: Rest_arigi Ĉion

source: Reset All
eo: Restarigi Ĉion

source: A_ssemble
eo: A_sembli

source: Only assemble program
eo: Nur asembli programon

source: Execute assembled and loaded program
eo: Ruli asemblitan kaj ŝargitan programon

source: Show _listing
eo: Montri _liston

source: Show the source code along with opcodes and operands in hex numbers
eo: Montri la fontkodon kune kun operacikodoj kaj operaciatoj deksesume

source: Step _in
eo: _Enpaŝi

source: Step in the code
eo: Enpaŝi en la kodon

source: Step o_ver
eo: _Transpaŝi

source: Step over the code without calling functions
eo: Transpaŝi la kodon, sen alvokado de funkcioj

source: Step _out
eo: E_lpaŝi

source: Step out of the current function
eo: Elpaŝi el la aktuala funkcio

source: Toggle _breakpoint
eo: Baskuligi _paŭzpunkton

source: Toggles breakpoint at current line
eo: Baskuligi paŭzpunkton ĉe aktuala linio

source: _Clear all breakpoints
eo: _Forviŝi ĉiujn paŭzpunktojn

source: Remove all breakpoints
eo: Forviŝi ĉiujn paŭzpunktojn

source: Stop execution
eo: Ĉesigi

source: Stop debugging
eo: Ĉesigi sencimigon

source: _Contents
eo: _Enhavoj

source: Assembler _Tutorial
eo: _Lernilo pri Asemblilo

source: Show/Hide side pane
eo: Montri/Kaŝi flankan panelon

source: GNUSim8085 - 8085 Microprocessor Simulator
eo: GNUSim8085 - Imitilo de Mikroprocesoro 8085

source: Registers
eo: Dateningoj

source: Flag
eo: Flago

source: Decimal
eo: Dekume

source: Enter a decimal number
eo: Tajpu dekuman nombron

source: To Hex
eo: Deksesumigi

source: Convert this number to hexadecimal
eo: Prezenti ĉi tiun nombron deksesume

source: Hex
eo: Deksesume

source: Enter a hexadecimal number
eo: Tajpu deksesuman nombron

source: To Dec
eo: Dekumigi

source: Convert this number to decimal
eo: Prezenti ĉi tiun nombron dekume

source: Decimal - Hex Conversion
eo: Dekuma - Deksesuma Konverto

source: Change the port address to view here
eo: Ŝanĝu la pordadreson vidu ĉi

source: Enter new port value and click Update
eo: Tajpu novan pordan valoron kaj alklaku la butonon "Ĝisdatigi"

source: Update Port Value
eo: Ĝisdatigi Pordan Valoron

source: Update the port value
eo: Ĝisdatigi la pordan valoron

source: I/O Ports
eo: Eneligaj Pordoj

source: Change the memory location to view here
eo: Ŝanĝu la memorlokon vidi ĉi

source: Edit new value and click Update
eo: Redaktu la valoron, kaj alklaku la butonon "Ĝisdatigi"

source: Update Memory
eo: Ĝisdatigi Memoron

source: Update the current memory location
eo: Ĝisdatigi la aktualan memorlokon

source: Memory
eo: Memoro

source: Load me at
eo: Ŝargi min ĉe

source: Enter the program address. End with a 'h' if it is a hex address.
eo: Tajpu la programadreson. Postmetu la literon 'h' se ĝi estas deksesuma adreso.

source: Data
eo: Datenoj

source: Stack
eo: Stako

source: KeyPad
eo: Cifera klavaro

source: Start
eo: Komenci

source: translator_credits
eo: Launchpad Contributions: Colin Dean https://launchpad.net/~colindean

source: Assembler Listing
eo: Asemblila listo

source: Save to file
eo: Konservi en dosieron

source: Assembler Tutorial
eo: Lernilo pri Asemblilo

source: GNUSim8085 start with dialog
eo: GNUSim8085 komencu kun dialogo

source: 1. How to use this simulator?
eo: 1. Kiel uzi ĉi tiun imitilon?

source: _Tutorial
eo: _Lernilo

source: A short tutorial on writing assembly code!
eo: Mallonga lernilo pri asembla lingvo!

source: 2. Open an existing assembly program.
eo: 2. Malfermu ekzistantan asemblalingvan programon.

source: _Open program
eo: Malfermi pr_ogramon

source: Open an already saved program
eo: Malfermu jam konservitan programon

source: What do you want to do now?
eo: Kion vi volas fari nun?

source: Don't forget to read the documentation given in "doc" directory.
eo: Ne forgesu legi la dokumentaron en la dosierujo "doc".

source: Choose a symbol
eo: Elektu simbolon

source: Enter a symbol or choose one from the lists
eo: Tajpu simbolon aŭ elektu unu el la listoj

source: Enter Symbol
eo: Tajpu Simbolon

source: Variables List
eo: Listo de variabloj

source: Functions List
eo: Listo de funkcioj

source: Macros List
eo: Listo de makrooj

source: Choose a register
eo: Elektu dateningon

source: Simulator: Idle
eo: Imitilo: senokupa

source: Unwanted %c reached
eo: Nedezirata %c atingiĝis

source: Invalid Opcode
eo: Nevalida Operacikodo

source: Instruction 'RIM' Not implemented
eo: Instrukcio 'RIM' ne estas uzebla

source: Instruction 'SIM' Not implemented
eo: Instrukcio 'SIM' ne estas uzebla

source: Assembling Aborted
eo: Ĉesis Asemblado

source: Label should be given to a code line
eo: Etikedo estu fiksita sur kodlinion

source: Incomplete opcode
eo: Nekompleta operacikodo

source: Neither Op not PsOp: [%s]
eo: Nek Operacio nek Pseŭdooperacio: [%s]

source: Invalid Opcode or Pseudo op
eo: Nevalida Operacikodo aŭ Pseŭdooperacio

source: Opcode needs an user argument
eo: Operacikoda bezonas uzantan argumenton

source: Extra characters in line
eo: Troaj signoj en linio

source: Expression error in symbol
eo: Eraro pri esprimo en simbolo

source: Undefined symbol
eo: Nedifinita simbolo

source: Redundant label
eo: Nenecesa etikedo

source: Invalid Operand in EQU
eo: Nevalida Operaciato en EQU

source: Invalid operand
eo: Nevalida operaciato

source: Redefinition of symbol
eo: Redifino de simbolo

source: Invalid data size
eo: Nevalida datengrando

source: DS: Exceeded limit
eo: DS: Limo estis superita

source: DB: Operand error
eo: DB: Eraro pri operaciato

source: Invalid operand or symbol. Check whether operands start with a number. e.g a0H should be 0a0H
eo: Nevalida operaciato aŭ simbolo. Kontrolu ĉu operaciatoj komenciĝas per cifero. Ekzemple, a0H estu 0a0H

source: Program assembled successfully
eo: Programo sukcese asembliĝis

source: Simulator: Program running
eo: Imitilo: Programo ruliĝas

source: Execution branched to invalid memory location <%xH>. Execution will be stopped! Check whether you've included the "hlt" instruction at the end of your program and your source program is not empty. Also check your program logic. If you're very sure, there might be a bug in GNUSim8085.If so you're advised to send a copy of your source program.
eo: Ruliĝo saltis al nevalida memora loko <%xH>. La programo kolapsos! Kontrolu ĉu vi inkluzivis la instrukcion "hlt" ĉe la fino de via programo kaj ĉu via programo ne estas malplena. Ankaŭ kontrolu la logikon de via programo. Se vi certegas, eble tio estas cimo en GNUSim8085. Do, bonvolu sendi kopion de via programo.

source: Assembler: running
eo: Asemblilo: ruliĝanta

source: Line No
eo: Lininumero

source: Assembler Message
eo: Asemblila mesaĝo

source: Address
eo: Adreso

source: Variable
eo: Variablo

source: Value
eo: Valoro

source: ; Assembler generated listing; Not editable.
eo: ; Asemblile generita listo; Ne redaktebla.

source: ; Generated by GNUSim8085: %s
eo: ; Generita de GNUSim8085: %s

source: ;Assembler Listing (Do Not assemble)
eo: ;Asembilia Listo (Ne asemblu)

source: Failed to open <%s>
eo: Malsukcesis malfermi <%s>

source: File already exists; overwrite it?
eo: Dosiero jam ekzistas; ĉu superskribi ĝin?

source: Failed to save <%s>
eo: Malsukcesis konservi <%s>

source: Failed to save listing file
eo: Malsukcesis konservi listan dosieron

source: Stack Loc
eo: Stakloko

source: Proc/Reg
eo: Dateningo

source: Stack size exceeded. Stop the execution
eo: Stakgrando trois. Ĉesigu

source: More number of POP are executed than PUSH. Stop the execution and check the logic of your program
eo: Pli da POP-instrukcioj estis farita ol PUSH-instrukcioj. Ĉesigu kaj kontrolu la logikon de via programo
